3º Semestre/[Prof. Marcelo Boer] Engenharia de Software I/README.md
```mermaid
classDiagram
    class Interessado {
        +int id_usuario
        +String nome_completo
        +String email
        +String telefone_whatsapp
        +String senha_acesso
        +String cidade
        +String estado
        +String foto_perfil
        +String cpf
        +Date data_nascimento
        +String bairro
        +Date data_cadastro
        +realizarLogin()
        +cadastrar()
        +editarPerfil()
    }

    class Anunciante {
        +int id_usuario
        +String nome_completo
        +String email
        +String telefone_whatsapp
        +String senha_acesso
        +String cidade
        +String estado
        +String foto_perfil
        +String cpf
        +Date data_nascimento
        +String bairro
        +Date data_cadastro
        +cadastrarProduto()
        +cadastrarAnuncio()
    }

    class Anuncio {
        +int id_anuncio
        +String fotos
        +String descricao
        +float preco
        +cadastrarAnuncio()
        +editarAnuncio()
        +excluirAnuncio()
    }

    class Categoria {
        +int id_categoria
        +String nome_categoria
    }

    class Compra {
        +int id_compra
        +Date data_compra
        +float valor_compra
        +realizarCompra()
    }

    class HistoricoContatos {
        +int id_historico
        +Date data_contato
        +trocarMensagens()
    }

    Anunciante --> Anuncio : cadastra / gerencia
    Anuncio --> Categoria : pertence a
    Compra --> Anuncio : contém produtos
    Compra --> Interessado : efetuada por
    Compra --> Anunciante : vendida por
    HistoricoContatos --> Interessado : envolve
    HistoricoContatos --> Anunciante : envolve
```
